# Origin Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
View..::..Origin Property
View Class See Also
---
Returns the origin of the screen.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public XYZ Origin { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Origin As XYZ
	Get
```

Visual C++
---
```text
public:
property XYZ^ Origin {
	XYZ^ get ();
}
```

# ### Field Value
nullNothingnullptra null reference (Nothing in Visual Basic) if the view is a template.
# Remarks
The origin of a plan view is not meaningful.
# See Also
View Class
Autodesk.Revit.DB Namespace